{"backend": "tensorflow", "class_name": "Sequential", "config": {"name": "sequential_51", "layers": [{"class_name": "Conv2D", "config": {"kernel_constraint": null, "activity_regularizer": null, "filters": 128, "trainable": true, "padding": "valid", "data_format": "channels_first", "name": "conv2d_150", "kernel_size": [4, 4], "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "relu", "strides": [1, 1], "batch_input_shape": [null, 1, 4, 70], "bias_regularizer": null, "bias_constraint": null, "dtype": "float32", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "dilation_rate": [1, 1], "use_bias": true}}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "activity_regularizer": null, "filters": 128, "trainable": true, "padding": "same", "data_format": "channels_first", "name": "conv2d_151", "kernel_size": [1, 1], "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "relu", "strides": [1, 1], "bias_regularizer": null, "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "dilation_rate": [1, 1], "use_bias": true}}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "activity_regularizer": null, "filters": 128, "trainable": true, "padding": "same", "data_format": "channels_first", "name": "conv2d_152", "kernel_size": [1, 1], "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "relu", "strides": [1, 1], "bias_regularizer": null, "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "dilation_rate": [1, 1], "use_bias": true}}, {"class_name": "Flatten", "config": {"data_format": "channels_last", "name": "flatten_51", "trainable": true}}, {"class_name": "Dense", "config": {"kernel_constraint": null, "activity_regularizer": null, "trainable": true, "bias_constraint": null, "name": "dense_135", "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "relu", "units": 128, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "use_bias": true}}, {"class_name": "Dense", "config": {"kernel_constraint": null, "activity_regularizer": null, "trainable": true, "bias_constraint": null, "name": "dense_136", "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "relu", "units": 128, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "use_bias": true}}, {"class_name": "Dense", "config": {"kernel_constraint": null, "activity_regularizer": null, "trainable": true, "bias_constraint": null, "name": "dense_137", "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear", "units": 1, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "use_bias": true}}]}, "keras_version": "2.2.4"}